app/views/carts/_cart.html.erb

<%  if !@cart.line_items.blank? %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 22