app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts`
---
  def index
    @carts = Cart.all

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1
---
  def show
    begin
       @cart = Cart.find(params[:id])

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-12-08 19:06:27', '2012-12-08 19:06:27')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1
---
  def update
    @cart = Cart.find(params[:id])

DELETE FROM `carts` WHERE `carts`.`id` = 21
---
  def destroy
    @cart = current_cart
    @cart.destroy