app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT `line_items`.* FROM `line_items`

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
	if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-12-15 17:10:16', '2012-12-15 17:10:16')
INSERT INTO `line_items` (`cart_id`, `created_at`, `order_id`, `price`, `product_id`, `quantity`, `updated_at`) VALUES (57, '2012-12-16 08:53:27', NULL, 49.95, 3, 1, '2012-12-16 08:53:27')
UPDATE `line_items` SET `quantity` = 7, `updated_at` = '2012-12-14 23:29:38' WHERE `line_items`.`id` = 50

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1

  def destroy
    @line_item = LineItem.find(params[:id])
    cart = @line_item.cart
    @line_item.destroy
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962