app/controllers/orders_controller.rb

SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
      @cart = current_cart
    @orders = Order.paginate page: params[:page], order: 'created_at desc',per_page: 10

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 59
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 59
---
  def new

    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('6200 paul-gury appt 204', '2012-12-18 02:50:33', 'duhjcsjckscjscsdc@gmail', 'Mamadou', 'Credit card', '2012-12-18 02:50:33')
DELETE FROM `carts` WHERE `carts`.`id` = 59
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])