app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2012-12-02 18:12:11', 'MyText', 'MyString', 9.99, 'MyString', '2012-12-02 18:12:11')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
UPDATE `products` SET `title` = 'Lorem Ipsum', `description` = 'Wibbles are fun!', `image_url` = 'lorem.jpg', `price` = 19.95, `updated_at` = '2012-12-05 01:55:42' WHERE `products`.`id` = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])